RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_back_reg.h
/**
  ******************************************************************************
  * @file    dsp2_back_reg.h
  * @version V1.0
  * @date    2021-02-05
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DSP2_BACK_REG_H__
#define __DSP2_BACK_REG_H__

#include "bl808.h"

/* 0x314 : ccr_coef_A */
#define DSP2_BACK_CCR_COEF_A_OFFSET (0x314)
#define DSP2_BACK_A11_PRE           DSP2_BACK_A11_PRE
#define DSP2_BACK_A11_PRE_POS       (16U)
#define DSP2_BACK_A11_PRE_LEN       (12U)
#define DSP2_BACK_A11_PRE_MSK       (((1U << DSP2_BACK_A11_PRE_LEN) - 1) << DSP2_BACK_A11_PRE_POS)
#define DSP2_BACK_A11_PRE_UMSK      (~(((1U << DSP2_BACK_A11_PRE_LEN) - 1) << DSP2_BACK_A11_PRE_POS))

/* 0x318 : ccr_coef_B */
#define DSP2_BACK_CCR_COEF_B_OFFSET (0x318)
#define DSP2_BACK_A12_PRE           DSP2_BACK_A12_PRE
#define DSP2_BACK_A12_PRE_POS       (0U)
#define DSP2_BACK_A12_PRE_LEN       (12U)
#define DSP2_BACK_A12_PRE_MSK       (((1U << DSP2_BACK_A12_PRE_LEN) - 1) << DSP2_BACK_A12_PRE_POS)
#define DSP2_BACK_A12_PRE_UMSK      (~(((1U << DSP2_BACK_A12_PRE_LEN) - 1) << DSP2_BACK_A12_PRE_POS))
#define DSP2_BACK_A13_PRE           DSP2_BACK_A13_PRE
#define DSP2_BACK_A13_PRE_POS       (16U)
#define DSP2_BACK_A13_PRE_LEN       (12U)
#define DSP2_BACK_A13_PRE_MSK       (((1U << DSP2_BACK_A13_PRE_LEN) - 1) << DSP2_BACK_A13_PRE_POS)
#define DSP2_BACK_A13_PRE_UMSK      (~(((1U << DSP2_BACK_A13_PRE_LEN) - 1) << DSP2_BACK_A13_PRE_POS))

/* 0x31C : ccr_coef_C */
#define DSP2_BACK_CCR_COEF_C_OFFSET (0x31C)
#define DSP2_BACK_A21_PRE           DSP2_BACK_A21_PRE
#define DSP2_BACK_A21_PRE_POS       (0U)
#define DSP2_BACK_A21_PRE_LEN       (12U)
#define DSP2_BACK_A21_PRE_MSK       (((1U << DSP2_BACK_A21_PRE_LEN) - 1) << DSP2_BACK_A21_PRE_POS)
#define DSP2_BACK_A21_PRE_UMSK      (~(((1U << DSP2_BACK_A21_PRE_LEN) - 1) << DSP2_BACK_A21_PRE_POS))
#define DSP2_BACK_A22_PRE           DSP2_BACK_A22_PRE
#define DSP2_BACK_A22_PRE_POS       (16U)
#define DSP2_BACK_A22_PRE_LEN       (12U)
#define DSP2_BACK_A22_PRE_MSK       (((1U << DSP2_BACK_A22_PRE_LEN) - 1) << DSP2_BACK_A22_PRE_POS)
#define DSP2_BACK_A22_PRE_UMSK      (~(((1U << DSP2_BACK_A22_PRE_LEN) - 1) << DSP2_BACK_A22_PRE_POS))

/* 0x320 : ccr_coef_D */
#define DSP2_BACK_CCR_COEF_D_OFFSET (0x320)
#define DSP2_BACK_A23_PRE           DSP2_BACK_A23_PRE
#define DSP2_BACK_A23_PRE_POS       (0U)
#define DSP2_BACK_A23_PRE_LEN       (12U)
#define DSP2_BACK_A23_PRE_MSK       (((1U << DSP2_BACK_A23_PRE_LEN) - 1) << DSP2_BACK_A23_PRE_POS)
#define DSP2_BACK_A23_PRE_UMSK      (~(((1U << DSP2_BACK_A23_PRE_LEN) - 1) << DSP2_BACK_A23_PRE_POS))
#define DSP2_BACK_A31_PRE           DSP2_BACK_A31_PRE
#define DSP2_BACK_A31_PRE_POS       (16U)
#define DSP2_BACK_A31_PRE_LEN       (12U)
#define DSP2_BACK_A31_PRE_MSK       (((1U << DSP2_BACK_A31_PRE_LEN) - 1) << DSP2_BACK_A31_PRE_POS)
#define DSP2_BACK_A31_PRE_UMSK      (~(((1U << DSP2_BACK_A31_PRE_LEN) - 1) << DSP2_BACK_A31_PRE_POS))

/* 0x324 : ccr_coef_E */
#define DSP2_BACK_CCR_COEF_E_OFFSET (0x324)
#define DSP2_BACK_A32_PRE           DSP2_BACK_A32_PRE
#define DSP2_BACK_A32_PRE_POS       (0U)
#define DSP2_BACK_A32_PRE_LEN       (12U)
#define DSP2_BACK_A32_PRE_MSK       (((1U << DSP2_BACK_A32_PRE_LEN) - 1) << DSP2_BACK_A32_PRE_POS)
#define DSP2_BACK_A32_PRE_UMSK      (~(((1U << DSP2_BACK_A32_PRE_LEN) - 1) << DSP2_BACK_A32_PRE_POS))
#define DSP2_BACK_A33_PRE           DSP2_BACK_A33_PRE
#define DSP2_BACK_A33_PRE_POS       (16U)
#define DSP2_BACK_A33_PRE_LEN       (12U)
#define DSP2_BACK_A33_PRE_MSK       (((1U << DSP2_BACK_A33_PRE_LEN) - 1) << DSP2_BACK_A33_PRE_POS)
#define DSP2_BACK_A33_PRE_UMSK      (~(((1U << DSP2_BACK_A33_PRE_LEN) - 1) << DSP2_BACK_A33_PRE_POS))

/* 0x328 : gamma_A */
#define DSP2_BACK_GAMMA_A_OFFSET    (0x328)
#define DSP2_BACK_GAMMA_ON_PRE      DSP2_BACK_GAMMA_ON_PRE
#define DSP2_BACK_GAMMA_ON_PRE_POS  (0U)
#define DSP2_BACK_GAMMA_ON_PRE_LEN  (1U)
#define DSP2_BACK_GAMMA_ON_PRE_MSK  (((1U << DSP2_BACK_GAMMA_ON_PRE_LEN) - 1) << DSP2_BACK_GAMMA_ON_PRE_POS)
#define DSP2_BACK_GAMMA_ON_PRE_UMSK (~(((1U << DSP2_BACK_GAMMA_ON_PRE_LEN) - 1) << DSP2_BACK_GAMMA_ON_PRE_POS))
#define DSP2_BACK_GAMMA_EB_PRE      DSP2_BACK_GAMMA_EB_PRE
#define DSP2_BACK_GAMMA_EB_PRE_POS  (1U)
#define DSP2_BACK_GAMMA_EB_PRE_LEN  (1U)
#define DSP2_BACK_GAMMA_EB_PRE_MSK  (((1U << DSP2_BACK_GAMMA_EB_PRE_LEN) - 1) << DSP2_BACK_GAMMA_EB_PRE_POS)
#define DSP2_BACK_GAMMA_EB_PRE_UMSK (~(((1U << DSP2_BACK_GAMMA_EB_PRE_LEN) - 1) << DSP2_BACK_GAMMA_EB_PRE_POS))
#define DSP2_BACK_B0_PRE            DSP2_BACK_B0_PRE
#define DSP2_BACK_B0_PRE_POS        (8U)
#define DSP2_BACK_B0_PRE_LEN        (8U)
#define DSP2_BACK_B0_PRE_MSK        (((1U << DSP2_BACK_B0_PRE_LEN) - 1) << DSP2_BACK_B0_PRE_POS)
#define DSP2_BACK_B0_PRE_UMSK       (~(((1U << DSP2_BACK_B0_PRE_LEN) - 1) << DSP2_BACK_B0_PRE_POS))
#define DSP2_BACK_B1_PRE            DSP2_BACK_B1_PRE
#define DSP2_BACK_B1_PRE_POS        (16U)
#define DSP2_BACK_B1_PRE_LEN        (8U)
#define DSP2_BACK_B1_PRE_MSK        (((1U << DSP2_BACK_B1_PRE_LEN) - 1) << DSP2_BACK_B1_PRE_POS)
#define DSP2_BACK_B1_PRE_UMSK       (~(((1U << DSP2_BACK_B1_PRE_LEN) - 1) << DSP2_BACK_B1_PRE_POS))
#define DSP2_BACK_B2_PRE            DSP2_BACK_B2_PRE
#define DSP2_BACK_B2_PRE_POS        (24U)
#define DSP2_BACK_B2_PRE_LEN        (8U)
#define DSP2_BACK_B2_PRE_MSK        (((1U << DSP2_BACK_B2_PRE_LEN) - 1) << DSP2_BACK_B2_PRE_POS)
#define DSP2_BACK_B2_PRE_UMSK       (~(((1U << DSP2_BACK_B2_PRE_LEN) - 1) << DSP2_BACK_B2_PRE_POS))

/* 0x32C : gamma_B */
#define DSP2_BACK_GAMMA_B_OFFSET (0x32C)
#define DSP2_BACK_B3_PRE         DSP2_BACK_B3_PRE
#define DSP2_BACK_B3_PRE_POS     (0U)
#define DSP2_BACK_B3_PRE_LEN     (8U)
#define DSP2_BACK_B3_PRE_MSK     (((1U << DSP2_BACK_B3_PRE_LEN) - 1) << DSP2_BACK_B3_PRE_POS)
#define DSP2_BACK_B3_PRE_UMSK    (~(((1U << DSP2_BACK_B3_PRE_LEN) - 1) << DSP2_BACK_B3_PRE_POS))
#define DSP2_BACK_B4_PRE         DSP2_BACK_B4_PRE
#define DSP2_BACK_B4_PRE_POS     (8U)
#define DSP2_BACK_B4_PRE_LEN     (8U)
#define DSP2_BACK_B4_PRE_MSK     (((1U << DSP2_BACK_B4_PRE_LEN) - 1) << DSP2_BACK_B4_PRE_POS)
#define DSP2_BACK_B4_PRE_UMSK    (~(((1U << DSP2_BACK_B4_PRE_LEN) - 1) << DSP2_BACK_B4_PRE_POS))
#define DSP2_BACK_B5_PRE         DSP2_BACK_B5_PRE
#define DSP2_BACK_B5_PRE_POS     (16U)
#define DSP2_BACK_B5_PRE_LEN     (8U)
#define DSP2_BACK_B5_PRE_MSK     (((1U << DSP2_BACK_B5_PRE_LEN) - 1) << DSP2_BACK_B5_PRE_POS)
#define DSP2_BACK_B5_PRE_UMSK    (~(((1U << DSP2_BACK_B5_PRE_LEN) - 1) << DSP2_BACK_B5_PRE_POS))
#define DSP2_BACK_B6_PRE         DSP2_BACK_B6_PRE
#define DSP2_BACK_B6_PRE_POS     (24U)
#define DSP2_BACK_B6_PRE_LEN     (8U)
#define DSP2_BACK_B6_PRE_MSK     (((1U << DSP2_BACK_B6_PRE_LEN) - 1) << DSP2_BACK_B6_PRE_POS)
#define DSP2_BACK_B6_PRE_UMSK    (~(((1U << DSP2_BACK_B6_PRE_LEN) - 1) << DSP2_BACK_B6_PRE_POS))

/* 0x330 : gamma_C */
#define DSP2_BACK_GAMMA_C_OFFSET (0x330)
#define DSP2_BACK_B7_PRE         DSP2_BACK_B7_PRE
#define DSP2_BACK_B7_PRE_POS     (0U)
#define DSP2_BACK_B7_PRE_LEN     (8U)
#define DSP2_BACK_B7_PRE_MSK     (((1U << DSP2_BACK_B7_PRE_LEN) - 1) << DSP2_BACK_B7_PRE_POS)
#define DSP2_BACK_B7_PRE_UMSK    (~(((1U << DSP2_BACK_B7_PRE_LEN) - 1) << DSP2_BACK_B7_PRE_POS))
#define DSP2_BACK_B8_PRE         DSP2_BACK_B8_PRE
#define DSP2_BACK_B8_PRE_POS     (8U)
#define DSP2_BACK_B8_PRE_LEN     (8U)
#define DSP2_BACK_B8_PRE_MSK     (((1U << DSP2_BACK_B8_PRE_LEN) - 1) << DSP2_BACK_B8_PRE_POS)
#define DSP2_BACK_B8_PRE_UMSK    (~(((1U << DSP2_BACK_B8_PRE_LEN) - 1) << DSP2_BACK_B8_PRE_POS))
#define DSP2_BACK_B9_PRE         DSP2_BACK_B9_PRE
#define DSP2_BACK_B9_PRE_POS     (16U)
#define DSP2_BACK_B9_PRE_LEN     (8U)
#define DSP2_BACK_B9_PRE_MSK     (((1U << DSP2_BACK_B9_PRE_LEN) - 1) << DSP2_BACK_B9_PRE_POS)
#define DSP2_BACK_B9_PRE_UMSK    (~(((1U << DSP2_BACK_B9_PRE_LEN) - 1) << DSP2_BACK_B9_PRE_POS))
#define DSP2_BACK_B10_PRE        DSP2_BACK_B10_PRE
#define DSP2_BACK_B10_PRE_POS    (24U)
#define DSP2_BACK_B10_PRE_LEN    (8U)
#define DSP2_BACK_B10_PRE_MSK    (((1U << DSP2_BACK_B10_PRE_LEN) - 1) << DSP2_BACK_B10_PRE_POS)
#define DSP2_BACK_B10_PRE_UMSK   (~(((1U << DSP2_BACK_B10_PRE_LEN) - 1) << DSP2_BACK_B10_PRE_POS))

/* 0x334 : gamma_D */
#define DSP2_BACK_GAMMA_D_OFFSET (0x334)
#define DSP2_BACK_B11_PRE        DSP2_BACK_B11_PRE
#define DSP2_BACK_B11_PRE_POS    (0U)
#define DSP2_BACK_B11_PRE_LEN    (8U)
#define DSP2_BACK_B11_PRE_MSK    (((1U << DSP2_BACK_B11_PRE_LEN) - 1) << DSP2_BACK_B11_PRE_POS)
#define DSP2_BACK_B11_PRE_UMSK   (~(((1U << DSP2_BACK_B11_PRE_LEN) - 1) << DSP2_BACK_B11_PRE_POS))
#define DSP2_BACK_B12_PRE        DSP2_BACK_B12_PRE
#define DSP2_BACK_B12_PRE_POS    (8U)
#define DSP2_BACK_B12_PRE_LEN    (8U)
#define DSP2_BACK_B12_PRE_MSK    (((1U << DSP2_BACK_B12_PRE_LEN) - 1) << DSP2_BACK_B12_PRE_POS)
#define DSP2_BACK_B12_PRE_UMSK   (~(((1U << DSP2_BACK_B12_PRE_LEN) - 1) << DSP2_BACK_B12_PRE_POS))
#define DSP2_BACK_B13_PRE        DSP2_BACK_B13_PRE
#define DSP2_BACK_B13_PRE_POS    (16U)
#define DSP2_BACK_B13_PRE_LEN    (8U)
#define DSP2_BACK_B13_PRE_MSK    (((1U << DSP2_BACK_B13_PRE_LEN) - 1) << DSP2_BACK_B13_PRE_POS)
#define DSP2_BACK_B13_PRE_UMSK   (~(((1U << DSP2_BACK_B13_PRE_LEN) - 1) << DSP2_BACK_B13_PRE_POS))
#define DSP2_BACK_B14_PRE        DSP2_BACK_B14_PRE
#define DSP2_BACK_B14_PRE_POS    (24U)
#define DSP2_BACK_B14_PRE_LEN    (8U)
#define DSP2_BACK_B14_PRE_MSK    (((1U << DSP2_BACK_B14_PRE_LEN) - 1) << DSP2_BACK_B14_PRE_POS)
#define DSP2_BACK_B14_PRE_UMSK   (~(((1U << DSP2_BACK_B14_PRE_LEN) - 1) << DSP2_BACK_B14_PRE_POS))

/* 0x338 : gamma_E */
#define DSP2_BACK_GAMMA_E_OFFSET (0x338)
#define DSP2_BACK_B15_PRE        DSP2_BACK_B15_PRE
#define DSP2_BACK_B15_PRE_POS    (0U)
#define DSP2_BACK_B15_PRE_LEN    (8U)
#define DSP2_BACK_B15_PRE_MSK    (((1U << DSP2_BACK_B15_PRE_LEN) - 1) << DSP2_BACK_B15_PRE_POS)
#define DSP2_BACK_B15_PRE_UMSK   (~(((1U << DSP2_BACK_B15_PRE_LEN) - 1) << DSP2_BACK_B15_PRE_POS))
#define DSP2_BACK_B16_PRE        DSP2_BACK_B16_PRE
#define DSP2_BACK_B16_PRE_POS    (8U)
#define DSP2_BACK_B16_PRE_LEN    (8U)
#define DSP2_BACK_B16_PRE_MSK    (((1U << DSP2_BACK_B16_PRE_LEN) - 1) << DSP2_BACK_B16_PRE_POS)
#define DSP2_BACK_B16_PRE_UMSK   (~(((1U << DSP2_BACK_B16_PRE_LEN) - 1) << DSP2_BACK_B16_PRE_POS))
#define DSP2_BACK_B17_PRE        DSP2_BACK_B17_PRE
#define DSP2_BACK_B17_PRE_POS    (16U)
#define DSP2_BACK_B17_PRE_LEN    (8U)
#define DSP2_BACK_B17_PRE_MSK    (((1U << DSP2_BACK_B17_PRE_LEN) - 1) << DSP2_BACK_B17_PRE_POS)
#define DSP2_BACK_B17_PRE_UMSK   (~(((1U << DSP2_BACK_B17_PRE_LEN) - 1) << DSP2_BACK_B17_PRE_POS))
#define DSP2_BACK_B18_PRE        DSP2_BACK_B18_PRE
#define DSP2_BACK_B18_PRE_POS    (24U)
#define DSP2_BACK_B18_PRE_LEN    (8U)
#define DSP2_BACK_B18_PRE_MSK    (((1U << DSP2_BACK_B18_PRE_LEN) - 1) << DSP2_BACK_B18_PRE_POS)
#define DSP2_BACK_B18_PRE_UMSK   (~(((1U << DSP2_BACK_B18_PRE_LEN) - 1) << DSP2_BACK_B18_PRE_POS))

