RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_back_reg.h
/* 0x33C : conv_mode */
#define DSP2_BACK_CONV_MODE_OFFSET (0x33C)
#define DSP2_BACK_CONV_MODE_W      DSP2_BACK_CONV_MODE_W
#define DSP2_BACK_CONV_MODE_W_POS  (0U)
#define DSP2_BACK_CONV_MODE_W_LEN  (1U)
#define DSP2_BACK_CONV_MODE_W_MSK  (((1U << DSP2_BACK_CONV_MODE_W_LEN) - 1) << DSP2_BACK_CONV_MODE_W_POS)
#define DSP2_BACK_CONV_MODE_W_UMSK (~(((1U << DSP2_BACK_CONV_MODE_W_LEN) - 1) << DSP2_BACK_CONV_MODE_W_POS))

/* 0x348 : edge_enhance */
#define DSP2_BACK_EDGE_ENHANCE_OFFSET      (0x348)
#define DSP2_BACK_ENHANCE_LEVEL_W          DSP2_BACK_ENHANCE_LEVEL_W
#define DSP2_BACK_ENHANCE_LEVEL_W_POS      (0U)
#define DSP2_BACK_ENHANCE_LEVEL_W_LEN      (7U)
#define DSP2_BACK_ENHANCE_LEVEL_W_MSK      (((1U << DSP2_BACK_ENHANCE_LEVEL_W_LEN) - 1) << DSP2_BACK_ENHANCE_LEVEL_W_POS)
#define DSP2_BACK_ENHANCE_LEVEL_W_UMSK     (~(((1U << DSP2_BACK_ENHANCE_LEVEL_W_LEN) - 1) << DSP2_BACK_ENHANCE_LEVEL_W_POS))
#define DSP2_BACK_EDGE_LIMIT_W             DSP2_BACK_EDGE_LIMIT_W
#define DSP2_BACK_EDGE_LIMIT_W_POS         (8U)
#define DSP2_BACK_EDGE_LIMIT_W_LEN         (8U)
#define DSP2_BACK_EDGE_LIMIT_W_MSK         (((1U << DSP2_BACK_EDGE_LIMIT_W_LEN) - 1) << DSP2_BACK_EDGE_LIMIT_W_POS)
#define DSP2_BACK_EDGE_LIMIT_W_UMSK        (~(((1U << DSP2_BACK_EDGE_LIMIT_W_LEN) - 1) << DSP2_BACK_EDGE_LIMIT_W_POS))
#define DSP2_BACK_HPF_RATE_W               DSP2_BACK_HPF_RATE_W
#define DSP2_BACK_HPF_RATE_W_POS           (16U)
#define DSP2_BACK_HPF_RATE_W_LEN           (4U)
#define DSP2_BACK_HPF_RATE_W_MSK           (((1U << DSP2_BACK_HPF_RATE_W_LEN) - 1) << DSP2_BACK_HPF_RATE_W_POS)
#define DSP2_BACK_HPF_RATE_W_UMSK          (~(((1U << DSP2_BACK_HPF_RATE_W_LEN) - 1) << DSP2_BACK_HPF_RATE_W_POS))
#define DSP2_BACK_NOISE_THRESHOLD_PRE      DSP2_BACK_NOISE_THRESHOLD_PRE
#define DSP2_BACK_NOISE_THRESHOLD_PRE_POS  (24U)
#define DSP2_BACK_NOISE_THRESHOLD_PRE_LEN  (7U)
#define DSP2_BACK_NOISE_THRESHOLD_PRE_MSK  (((1U << DSP2_BACK_NOISE_THRESHOLD_PRE_LEN) - 1) << DSP2_BACK_NOISE_THRESHOLD_PRE_POS)
#define DSP2_BACK_NOISE_THRESHOLD_PRE_UMSK (~(((1U << DSP2_BACK_NOISE_THRESHOLD_PRE_LEN) - 1) << DSP2_BACK_NOISE_THRESHOLD_PRE_POS))

/* 0x34C : YUVC_A */
#define DSP2_BACK_YUVC_A_OFFSET         (0x34C)
#define DSP2_BACK_YBRIGHTNESS_W         DSP2_BACK_YBRIGHTNESS_W
#define DSP2_BACK_YBRIGHTNESS_W_POS     (0U)
#define DSP2_BACK_YBRIGHTNESS_W_LEN     (8U)
#define DSP2_BACK_YBRIGHTNESS_W_MSK     (((1U << DSP2_BACK_YBRIGHTNESS_W_LEN) - 1) << DSP2_BACK_YBRIGHTNESS_W_POS)
#define DSP2_BACK_YBRIGHTNESS_W_UMSK    (~(((1U << DSP2_BACK_YBRIGHTNESS_W_LEN) - 1) << DSP2_BACK_YBRIGHTNESS_W_POS))
#define DSP2_BACK_YCONTRAST_W           DSP2_BACK_YCONTRAST_W
#define DSP2_BACK_YCONTRAST_W_POS       (8U)
#define DSP2_BACK_YCONTRAST_W_LEN       (8U)
#define DSP2_BACK_YCONTRAST_W_MSK       (((1U << DSP2_BACK_YCONTRAST_W_LEN) - 1) << DSP2_BACK_YCONTRAST_W_POS)
#define DSP2_BACK_YCONTRAST_W_UMSK      (~(((1U << DSP2_BACK_YCONTRAST_W_LEN) - 1) << DSP2_BACK_YCONTRAST_W_POS))
#define DSP2_BACK_CBSATURATION_PRE      DSP2_BACK_CBSATURATION_PRE
#define DSP2_BACK_CBSATURATION_PRE_POS  (16U)
#define DSP2_BACK_CBSATURATION_PRE_LEN  (8U)
#define DSP2_BACK_CBSATURATION_PRE_MSK  (((1U << DSP2_BACK_CBSATURATION_PRE_LEN) - 1) << DSP2_BACK_CBSATURATION_PRE_POS)
#define DSP2_BACK_CBSATURATION_PRE_UMSK (~(((1U << DSP2_BACK_CBSATURATION_PRE_LEN) - 1) << DSP2_BACK_CBSATURATION_PRE_POS))
#define DSP2_BACK_CRSATURATION_PRE      DSP2_BACK_CRSATURATION_PRE
#define DSP2_BACK_CRSATURATION_PRE_POS  (24U)
#define DSP2_BACK_CRSATURATION_PRE_LEN  (8U)
#define DSP2_BACK_CRSATURATION_PRE_MSK  (((1U << DSP2_BACK_CRSATURATION_PRE_LEN) - 1) << DSP2_BACK_CRSATURATION_PRE_POS)
#define DSP2_BACK_CRSATURATION_PRE_UMSK (~(((1U << DSP2_BACK_CRSATURATION_PRE_LEN) - 1) << DSP2_BACK_CRSATURATION_PRE_POS))

/* 0x350 : YUVC_B */
#define DSP2_BACK_YUVC_B_OFFSET                 (0x350)
#define DSP2_BACK_SPECIALMODE_W                 DSP2_BACK_SPECIALMODE_W
#define DSP2_BACK_SPECIALMODE_W_POS             (0U)
#define DSP2_BACK_SPECIALMODE_W_LEN             (3U)
#define DSP2_BACK_SPECIALMODE_W_MSK             (((1U << DSP2_BACK_SPECIALMODE_W_LEN) - 1) << DSP2_BACK_SPECIALMODE_W_POS)
#define DSP2_BACK_SPECIALMODE_W_UMSK            (~(((1U << DSP2_BACK_SPECIALMODE_W_LEN) - 1) << DSP2_BACK_SPECIALMODE_W_POS))
#define DSP2_BACK_C444TO422FILTERINGMODE_W      DSP2_BACK_C444TO422FILTERINGMODE_W
#define DSP2_BACK_C444TO422FILTERINGMODE_W_POS  (4U)
#define DSP2_BACK_C444TO422FILTERINGMODE_W_LEN  (1U)
#define DSP2_BACK_C444TO422FILTERINGMODE_W_MSK  (((1U << DSP2_BACK_C444TO422FILTERINGMODE_W_LEN) - 1) << DSP2_BACK_C444TO422FILTERINGMODE_W_POS)
#define DSP2_BACK_C444TO422FILTERINGMODE_W_UMSK (~(((1U << DSP2_BACK_C444TO422FILTERINGMODE_W_LEN) - 1) << DSP2_BACK_C444TO422FILTERINGMODE_W_POS))
#define DSP2_BACK_SEPIACB_W                     DSP2_BACK_SEPIACB_W
#define DSP2_BACK_SEPIACB_W_POS                 (8U)
#define DSP2_BACK_SEPIACB_W_LEN                 (8U)
#define DSP2_BACK_SEPIACB_W_MSK                 (((1U << DSP2_BACK_SEPIACB_W_LEN) - 1) << DSP2_BACK_SEPIACB_W_POS)
#define DSP2_BACK_SEPIACB_W_UMSK                (~(((1U << DSP2_BACK_SEPIACB_W_LEN) - 1) << DSP2_BACK_SEPIACB_W_POS))
#define DSP2_BACK_SEPIACR_W                     DSP2_BACK_SEPIACR_W
#define DSP2_BACK_SEPIACR_W_POS                 (16U)
#define DSP2_BACK_SEPIACR_W_LEN                 (8U)
#define DSP2_BACK_SEPIACR_W_MSK                 (((1U << DSP2_BACK_SEPIACR_W_LEN) - 1) << DSP2_BACK_SEPIACR_W_POS)
#define DSP2_BACK_SEPIACR_W_UMSK                (~(((1U << DSP2_BACK_SEPIACR_W_LEN) - 1) << DSP2_BACK_SEPIACR_W_POS))
#define DSP2_BACK_SOLARTHRED_W                  DSP2_BACK_SOLARTHRED_W
#define DSP2_BACK_SOLARTHRED_W_POS              (24U)
#define DSP2_BACK_SOLARTHRED_W_LEN              (8U)
#define DSP2_BACK_SOLARTHRED_W_MSK              (((1U << DSP2_BACK_SOLARTHRED_W_LEN) - 1) << DSP2_BACK_SOLARTHRED_W_POS)
#define DSP2_BACK_SOLARTHRED_W_UMSK             (~(((1U << DSP2_BACK_SOLARTHRED_W_LEN) - 1) << DSP2_BACK_SOLARTHRED_W_POS))

/* 0x354 : DNR_A */
#define DSP2_BACK_DNR_A_OFFSET              (0x354)
#define DSP2_BACK_NOISE_LEVEL_PRE           DSP2_BACK_NOISE_LEVEL_PRE
#define DSP2_BACK_NOISE_LEVEL_PRE_POS       (0U)
#define DSP2_BACK_NOISE_LEVEL_PRE_LEN       (6U)
#define DSP2_BACK_NOISE_LEVEL_PRE_MSK       (((1U << DSP2_BACK_NOISE_LEVEL_PRE_LEN) - 1) << DSP2_BACK_NOISE_LEVEL_PRE_POS)
#define DSP2_BACK_NOISE_LEVEL_PRE_UMSK      (~(((1U << DSP2_BACK_NOISE_LEVEL_PRE_LEN) - 1) << DSP2_BACK_NOISE_LEVEL_PRE_POS))
#define DSP2_BACK_NR_HSIZE_PRE              DSP2_BACK_NR_HSIZE_PRE
#define DSP2_BACK_NR_HSIZE_PRE_POS          (8U)
#define DSP2_BACK_NR_HSIZE_PRE_LEN          (16U)
#define DSP2_BACK_NR_HSIZE_PRE_MSK          (((1U << DSP2_BACK_NR_HSIZE_PRE_LEN) - 1) << DSP2_BACK_NR_HSIZE_PRE_POS)
#define DSP2_BACK_NR_HSIZE_PRE_UMSK         (~(((1U << DSP2_BACK_NR_HSIZE_PRE_LEN) - 1) << DSP2_BACK_NR_HSIZE_PRE_POS))
#define DSP2_BACK_FILT_STRENGTH_2D_PRE      DSP2_BACK_FILT_STRENGTH_2D_PRE
#define DSP2_BACK_FILT_STRENGTH_2D_PRE_POS  (24U)
#define DSP2_BACK_FILT_STRENGTH_2D_PRE_LEN  (4U)
#define DSP2_BACK_FILT_STRENGTH_2D_PRE_MSK  (((1U << DSP2_BACK_FILT_STRENGTH_2D_PRE_LEN) - 1) << DSP2_BACK_FILT_STRENGTH_2D_PRE_POS)
#define DSP2_BACK_FILT_STRENGTH_2D_PRE_UMSK (~(((1U << DSP2_BACK_FILT_STRENGTH_2D_PRE_LEN) - 1) << DSP2_BACK_FILT_STRENGTH_2D_PRE_POS))
#define DSP2_BACK_FILT_STRENGTH_3D_PRE      DSP2_BACK_FILT_STRENGTH_3D_PRE
#define DSP2_BACK_FILT_STRENGTH_3D_PRE_POS  (28U)
#define DSP2_BACK_FILT_STRENGTH_3D_PRE_LEN  (4U)
#define DSP2_BACK_FILT_STRENGTH_3D_PRE_MSK  (((1U << DSP2_BACK_FILT_STRENGTH_3D_PRE_LEN) - 1) << DSP2_BACK_FILT_STRENGTH_3D_PRE_POS)
#define DSP2_BACK_FILT_STRENGTH_3D_PRE_UMSK (~(((1U << DSP2_BACK_FILT_STRENGTH_3D_PRE_LEN) - 1) << DSP2_BACK_FILT_STRENGTH_3D_PRE_POS))

/* 0x358 : DNR_B */
#define DSP2_BACK_DNR_B_OFFSET        (0x358)
#define DSP2_BACK_DELAYNUM3DNR_W      DSP2_BACK_DELAYNUM3DNR_W
#define DSP2_BACK_DELAYNUM3DNR_W_POS  (0U)
#define DSP2_BACK_DELAYNUM3DNR_W_LEN  (3U)
#define DSP2_BACK_DELAYNUM3DNR_W_MSK  (((1U << DSP2_BACK_DELAYNUM3DNR_W_LEN) - 1) << DSP2_BACK_DELAYNUM3DNR_W_POS)
#define DSP2_BACK_DELAYNUM3DNR_W_UMSK (~(((1U << DSP2_BACK_DELAYNUM3DNR_W_LEN) - 1) << DSP2_BACK_DELAYNUM3DNR_W_POS))
#define DSP2_BACK_CBCR_SELECT_W       DSP2_BACK_CBCR_SELECT_W
#define DSP2_BACK_CBCR_SELECT_W_POS   (8U)
#define DSP2_BACK_CBCR_SELECT_W_LEN   (1U)
#define DSP2_BACK_CBCR_SELECT_W_MSK   (((1U << DSP2_BACK_CBCR_SELECT_W_LEN) - 1) << DSP2_BACK_CBCR_SELECT_W_POS)
#define DSP2_BACK_CBCR_SELECT_W_UMSK  (~(((1U << DSP2_BACK_CBCR_SELECT_W_LEN) - 1) << DSP2_BACK_CBCR_SELECT_W_POS))
#define DSP2_BACK_OUT_FORMAT_W        DSP2_BACK_OUT_FORMAT_W
#define DSP2_BACK_OUT_FORMAT_W_POS    (9U)
#define DSP2_BACK_OUT_FORMAT_W_LEN    (2U)
#define DSP2_BACK_OUT_FORMAT_W_MSK    (((1U << DSP2_BACK_OUT_FORMAT_W_LEN) - 1) << DSP2_BACK_OUT_FORMAT_W_POS)
#define DSP2_BACK_OUT_FORMAT_W_UMSK   (~(((1U << DSP2_BACK_OUT_FORMAT_W_LEN) - 1) << DSP2_BACK_OUT_FORMAT_W_POS))

/* 0x3FF : DVI_HDMI_MODE */
#define DSP2_BACK_DVI_HDMI_MODE_OFFSET (0x3FF)
#define DSP2_BACK_DVI_HDMI_MODE_W      DSP2_BACK_DVI_HDMI_MODE_W
#define DSP2_BACK_DVI_HDMI_MODE_W_POS  (0U)
#define DSP2_BACK_DVI_HDMI_MODE_W_LEN  (1U)
#define DSP2_BACK_DVI_HDMI_MODE_W_MSK  (((1U << DSP2_BACK_DVI_HDMI_MODE_W_LEN) - 1) << DSP2_BACK_DVI_HDMI_MODE_W_POS)
#define DSP2_BACK_DVI_HDMI_MODE_W_UMSK (~(((1U << DSP2_BACK_DVI_HDMI_MODE_W_LEN) - 1) << DSP2_BACK_DVI_HDMI_MODE_W_POS))

struct dsp2_back_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[788];

    /* 0x314 : ccr_coef_A */
    union {
        struct
        {
            uint32_t reserved_0_15  : 16; /* [15: 0],       rsvd,        0x0 */
            uint32_t a11_pre        : 12; /* [27:16],        r/w,      0x200 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ccr_coef_A;

    /* 0x318 : ccr_coef_B */
    union {
        struct
        {
            uint32_t a12_pre        : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t a13_pre        : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ccr_coef_B;

    /* 0x31C : ccr_coef_C */
    union {
        struct
        {
            uint32_t a21_pre        : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t a22_pre        : 12; /* [27:16],        r/w,      0x200 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ccr_coef_C;

    /* 0x320 : ccr_coef_D */
    union {
        struct
        {
            uint32_t a23_pre        : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t a31_pre        : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ccr_coef_D;

    /* 0x324 : ccr_coef_E */
    union {
        struct
        {
            uint32_t a32_pre        : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t a33_pre        : 12; /* [27:16],        r/w,      0x200 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ccr_coef_E;

