RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_back_reg.h
    /* 0x328 : gamma_A */
    union {
        struct
        {
            uint32_t gamma_on_pre : 1; /* [    0],        r/w,        0x0 */
            uint32_t gamma_eb_pre : 1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_7 : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t b0_pre       : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t b1_pre       : 8; /* [23:16],        r/w,        0x4 */
            uint32_t b2_pre       : 8; /* [31:24],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } gamma_A;

    /* 0x32C : gamma_B */
    union {
        struct
        {
            uint32_t b3_pre : 8; /* [ 7: 0],        r/w,       0x10 */
            uint32_t b4_pre : 8; /* [15: 8],        r/w,       0x20 */
            uint32_t b5_pre : 8; /* [23:16],        r/w,       0x30 */
            uint32_t b6_pre : 8; /* [31:24],        r/w,       0x40 */
        } BF;
        uint32_t WORD;
    } gamma_B;

    /* 0x330 : gamma_C */
    union {
        struct
        {
            uint32_t b7_pre  : 8; /* [ 7: 0],        r/w,       0x50 */
            uint32_t b8_pre  : 8; /* [15: 8],        r/w,       0x60 */
            uint32_t b9_pre  : 8; /* [23:16],        r/w,       0x70 */
            uint32_t b10_pre : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } gamma_C;

    /* 0x334 : gamma_D */
    union {
        struct
        {
            uint32_t b11_pre : 8; /* [ 7: 0],        r/w,       0x90 */
            uint32_t b12_pre : 8; /* [15: 8],        r/w,       0xa0 */
            uint32_t b13_pre : 8; /* [23:16],        r/w,       0xb0 */
            uint32_t b14_pre : 8; /* [31:24],        r/w,       0xc0 */
        } BF;
        uint32_t WORD;
    } gamma_D;

    /* 0x338 : gamma_E */
    union {
        struct
        {
            uint32_t b15_pre : 8; /* [ 7: 0],        r/w,       0xd0 */
            uint32_t b16_pre : 8; /* [15: 8],        r/w,       0xe0 */
            uint32_t b17_pre : 8; /* [23:16],        r/w,       0xf0 */
            uint32_t b18_pre : 8; /* [31:24],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } gamma_E;

    /* 0x33C : conv_mode */
    union {
        struct
        {
            uint32_t conv_mode_w   : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } conv_mode;

    /* 0x340  reserved */
    uint8_t RESERVED0x340[8];

    /* 0x348 : edge_enhance */
    union {
        struct
        {
            uint32_t enhance_level_w     : 7; /* [ 6: 0],        r/w,       0x69 */
            uint32_t reserved_7          : 1; /* [    7],       rsvd,        0x0 */
            uint32_t edge_limit_w        : 8; /* [15: 8],        r/w,       0x30 */
            uint32_t HPF_rate_w          : 4; /* [19:16],        r/w,        0x4 */
            uint32_t reserved_20_23      : 4; /* [23:20],       rsvd,        0x0 */
            uint32_t noise_threshold_pre : 7; /* [30:24],        r/w,        0x0 */
            uint32_t reserved_31         : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } edge_enhance;

    /* 0x34C : YUVC_A */
    union {
        struct
        {
            uint32_t YBrightness_w    : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t YContrast_w      : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t CbSaturation_pre : 8; /* [23:16],        r/w,       0x80 */
            uint32_t CrSaturation_pre : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } YUVC_A;

    /* 0x350 : YUVC_B */
    union {
        struct
        {
            uint32_t SpecialMode_w            : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t reserved_3               : 1; /* [    3],       rsvd,        0x0 */
            uint32_t C444to422Filteringmode_w : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7             : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t SepiaCb_w                : 8; /* [15: 8],        r/w,       0x73 */
            uint32_t SepiaCr_w                : 8; /* [23:16],        r/w,       0x89 */
            uint32_t SolarThred_w             : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } YUVC_B;

    /* 0x354 : DNR_A */
    union {
        struct
        {
            uint32_t noise_level_pre      : 6;  /* [ 5: 0],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t nr_hsize_pre         : 16; /* [23: 8],        r/w,      0x788 */
            uint32_t Filt_Strength_2D_pre : 4;  /* [27:24],        r/w,        0x6 */
            uint32_t Filt_Strength_3D_pre : 4;  /* [31:28],        r/w,        0x5 */
        } BF;
        uint32_t WORD;
    } DNR_A;

    /* 0x358 : DNR_B */
    union {
        struct
        {
            uint32_t DelayNum3DNR_w : 3;  /* [ 2: 0],        r/w,        0x4 */
            uint32_t reserved_3_7   : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t CbCr_select_w  : 1;  /* [    8],        r/w,        0x1 */
            uint32_t out_format_w   : 2;  /* [10: 9],        r/w,        0x1 */
            uint32_t reserved_11_31 : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DNR_B;

    /* 0x35c  reserved */
    uint8_t RESERVED0x35c[163];

    /* 0x3FF : DVI_HDMI_MODE */
    union {
        struct
        {
            uint32_t DVI_HDMI_MODE_w : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31   : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DVI_HDMI_MODE;
};

typedef volatile struct dsp2_back_reg dsp2_back_reg_t;

#endif /* __DSP2_BACK_REG_H__ */
